---
kind: method
id: M:Autodesk.Revit.DB.CategoryNameMap.Clear
source: html/af97ab30-831f-2dcb-73a3-5cc3ad59025c.htm
---
# Autodesk.Revit.DB.CategoryNameMap.Clear Method

Removes every category from the map, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```